app/controllers/issues_controller.rb

  def index
    if params[:status] == "open"
      @issues = Issue.where(status: "open")
    elsif params[:status] == "onhold"
      @issues = Issue.where(status: "onhold")
    elsif params[:status] == "resolved"
      @issues = Issue.where(status: "resolved")
    elsif params[:status] == "duplicate"
      @issues = Issue.where(status: "duplicate")
    elsif params[:status] == "invalid"
      @issues = Issue.where(status: "invalid")
    elsif params[:status] == "wontfix"
      @issues = Issue.where(status: "wontfix")
    elsif params[:status] == "closed"
      @issues = Issue.where(status: "closed")
    else
      @issues = Issue.all
---
SELECT "issues".* FROM "issues"

  def create
    @issue = Issue.new(issue_params)
    @issue.user_id = current_user.id
    respond_to do |format|
      if @issue.save
---
INSERT INTO "issues" ("title", "description", "priority", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "2"], ["description", "2"], ["priority", "2"], ["user_id", 1], ["created_at", "2019-03-23 21:17:34.255092"], ["updated_at", "2019-03-23 21:17:34.255092"]]

  def destroy
    @issue.destroy
---
DELETE FROM "issues" WHERE "issues"."id" = ?  [["id", 4]]

    def set_issue
      @issue = Issue.find(params[:id])
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]